Repository: CofficLab/GitOK
Catalog: Packages/ProjectRulesKit/Sources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant, zh_hk

source: Cancel
zh_hans: 取消
zh_hant: 取消
zh_hk: 取消

source: Checking Remote Status…
zh_hans: 检查远程状态…
zh_hant: 检查远程状态…
zh_hk: 檢查遠端狀態…

source: Network connection error, auto-retry failed. You can try:
zh_hans: 网络连接错误，自动重试失败。你可以尝试：
zh_hant: 网络连接错误，自动重试失败。你可以尝试：
zh_hk: 網絡連線錯誤，自動重試失敗。你可以嘗試：

source: Network fluctuation, retrying (%lld/%lld)…
zh_hans: 网络波动，正在重试（%lld/%lld）…
zh_hant: 网络波动，正在重试（%lld/%lld）…
zh_hk: 網絡波動，正在重試（%lld/%lld）…

source: Pulling…
zh_hans: 拉取中…
zh_hant: 拉取中…
zh_hk: 拉取中…

source: Push Failed
zh_hans: 推送失败
zh_hant: 推送失败
zh_hk: 推送失敗

source: Pushing via system Git…
zh_hans: 通过系统 Git 推送中…
zh_hant: 通过系统 Git 推送中…
zh_hk: 透過系統 Git 推送中…

source: Pushing…
zh_hans: 推送中…
zh_hant: 推送中…
zh_hk: 推送中…

source: Refresh File List…
zh_hans: 刷新文件列表…
zh_hant: 刷新文件列表…
zh_hk: 重新整理檔案列表…

source: Retry
zh_hans: 重试
zh_hant: 重试
zh_hk: 重試

source: Toggle SSH Push
zh_hans: 切换 SSH 推送
zh_hant: 切换 SSH 推送
zh_hk: 切換 SSH 推送

# GitHub authentication note
source: GitHub HTTPS typically uses tokens or credential helpers, while SSH uses keys from your local keychain/agent.
zh_hans: GitHub HTTPS 通常使用 token 或 credential helper，SSH 使用本机 keychain/agent 中的密钥。
zh_hant: GitHub HTTPS 通常使用 token 或 credential helper，SSH 使用本機 keychain/agent 中的密鑰。
zh_hk: GitHub HTTPS 通常使用 token 或 credential helper，SSH 使用本機 keychain/agent 中的密鑰。

# GitLab authentication note
source: GitLab HTTPS can use personal/project access tokens, while SSH uses configured SSH keys.
zh_hans: GitLab HTTPS 可使用 personal/project access token，SSH 使用已配置的 SSH key。
zh_hant: GitLab HTTPS 可使用 personal/project access token，SSH 使用已配置的 SSH key。
zh_hk: GitLab HTTPS 可使用 personal/project access token，SSH 使用已配置的 SSH key。

# Bitbucket authentication note
source: Bitbucket HTTPS typically uses app passwords or workspace tokens, while SSH uses configured SSH keys.
zh_hans: Bitbucket HTTPS 通常使用 app password 或 workspace token，SSH 使用已配置的 SSH key。
zh_hant: Bitbucket HTTPS 通常使用 app password 或 workspace token，SSH 使用已配置的 SSH key。
zh_hk: Bitbucket HTTPS 通常使用 app password 或 workspace token，SSH 使用已配置的 SSH key。

# Azure DevOps authentication note
source: Azure DevOps HTTPS commonly uses PAT or enterprise identity login, while SSH URLs are affected by organization policies and key configuration.
zh_hans: Azure DevOps HTTPS 常见为 PAT 或企业身份登录，SSH URL 受组织策略和 key 配置影响。
zh_hant: Azure DevOps HTTPS 常見為 PAT 或企業身份登入，SSH URL 受組織策略和 key 配置影響。
zh_hk: Azure DevOps HTTPS 常見為 PAT 或企業身份登入，SSH URL 受組織策略和 key 配置影響。

# Unknown platform authentication note
source: Unrecognized Git hosting platforms are handled as generic Git remotes. Authentication methods depend on server configuration.
zh_hans: 未识别的 Git 托管平台会按通用 Git 远程处理，认证方式取决于服务器配置。
zh_hant: 未識別的 Git 託管平台會按通用 Git 遠程處理，認證方式取決於服務器配置。
zh_hk: 未識別的 Git 託管平台會按通用 Git 遠程處理，認證方式取決於服務器配置。

# Delete upstream remote warning
source: Deleting remote repository "%@" will remove the remote tracking relationship for the current branch. Push/Pull status will show no upstream. This action cannot be undone.
zh_hans: 删除远程仓库 "%@" 会移除当前分支的远程跟踪关系，Push/Pull 状态会变为无 upstream。此操作不可撤销。
zh_hant: 刪除遠程儲存庫 "%@" 會移除當前分支的遠程跟踪關係，Push/Pull 狀態會變為無 upstream。此操作不可撤銷。
zh_hk: 刪除遠程儲存庫 "%@" 會移除當前分支的遠程跟踪關係，Push/Pull 狀態會變為無 upstream。此操作不可撤銷。

# Delete remote warning
source: Are you sure you want to delete remote repository "%@"? Remote branches, tag pushes, and subsequent Fetch/Pull operations that depend on it will be affected. This action cannot be undone.
zh_hans: 确定要删除远程仓库 "%@" 吗？依赖它的远程分支、标签推送和后续 Fetch/Pull 操作都会受影响。此操作不可撤销。
zh_hant: 確定要刪除遠程儲存庫 "%@" 嗎？依賴它的遠程分支、標籤推送和後續 Fetch/Pull 操作都會受影響。此操作不可撤銷。
zh_hk: 確定要刪除遠程儲存庫 "%@" 嗎？依賴它的遠程分支、標籤推送和後續 Fetch/Pull 操作都會受影響。此操作不可撤銷。

# Emoji sparkles detail
source: New feature
zh_hans: 新功能
zh_hant: 新功能
zh_hk: 新功能

# Emoji bug detail
source: Bug fix
zh_hans: 修复问题
zh_hant: 修復問題
zh_hk: 修復問題

# Emoji memo detail
source: Documentation
zh_hans: 文档
zh_hant: 文檔
zh_hk: 文檔

# Emoji recycle detail
source: Refactoring
zh_hans: 重构
zh_hant: 重構
zh_hk: 重構

# Emoji zap detail
source: Performance
zh_hans: 性能
zh_hant: 性能
zh_hk: 性能

# Emoji check mark detail
source: Testing
zh_hans: 测试
zh_hant: 測試
zh_hk: 測試

# Emoji lipstick detail
source: UI styling
zh_hans: UI 样式
zh_hant: UI 樣式
zh_hk: UI 樣式

# Emoji wrench detail
source: Configuration
zh_hans: 配置
zh_hant: 配置
zh_hk: 配置

# Issue reference detail
source: Issue reference
zh_hans: Issue 引用
zh_hant: Issue 引用
zh_hk: Issue 引用

# User mention detail
source: User mention
zh_hans: 用户 mention
zh_hant: 用戶 mention
zh_hk: 用戶 mention
